{
    "home": "Start",
    "about": "Bewerbung",
    "internship": "Praktikum",
    "benefits": "Vorteile",
    "qualifications": "Qualifikationen",
    "training": "Ausbildung",
    "resume": "Lebenslauf",
    "softskills": "Softskills",

    "headline": "A future professional for your company",
    "learnMore": "Mehr erfahren",

    "aboutSubline": "Für einen Praktikumsplatz",
    "aboutSection_1": "Während meiner selbstständigen Tätigkeit im E-Commerce befasste ich mich u.a. mit der kontinuierlichen Optimierung des Webshops und hatte so meine ersten Berührungspunkte mit HTML, CSS, JavaScript & Co. Bei dieser Tätigkeit stellte ich fest, dass das Programmieren interessanter und erfüllender war, als die Umsetzung kaufmännischer Betriebsabläufe. Durch die Möglichkeit der Umschulung und dem damit verbundenen Einstieg in die professionelle Anwendungsentwicklung, entschloss ich mich, meine selbstständige Tätigkeit einzustellen und meine gesamte Energie in die Ausbildung zu investieren.",
    "aboutSection_2": "Die Umschulung entspricht einem staatlich geförderten Bildungsprogramm für den IHK-Abschluss als Fachinformatiker für Anwendungsentwicklung mit einer verkürzten Dauer von zwei Jahren. Die Inhalte der Ausbildung umfassen den Erwerb grundlegender IT-Kenntnisse, IT-Fachqualifikationen sowie Zertifizierungen wie OCA (Oracle Certified Associate Java) und Agil Scrum Foundation. Die Umschulung beinhaltet ein obligatorisches neunmonatiges Praktikum, das vom 6. Mai 2024 bis zum 29. Januar 2025 stattfindet. Neben der Berechtigung zur IHK-Prüfung zielt das Praktikum darauf ab, erweiterte praktische Fähigkeiten und Einblicke in das reale Arbeitsleben eines IT-Unternehmens zu gewinnen. In diesem Zusammenhang bewerbe ich mich für einen Praktikumsplatz in Ihrem Unternehmen und freue mich darauf, von Ihnen zu lernen und das neu erworbene Wissen in Ihrem Unternehmen einzubringen.",

    "internshipDate": "6. Mai 2024 - 29. Januar 2025",
    "internshipSection_1": "Mit dem Praktikum in Ihrem Betrieb erhoffe ich mir die Erweiterung meiner fachlichen Fähigkeiten und freue mich, diese Kenntnisse bei der täglichen Lösungsfindung anwenden zu können. Dabei werde ich Ihre Fachkräfte zunächst bei Routineaufgaben entlasten und später professionell unterstützen können. Problemlösungen in der Programmierung und das Implementieren von Funktionalitäten haben mich seit meiner ersten Begegnung mit der Thematik fasziniert.",
    "internshipSection_2": "Ich bin zuversichtlich, dass ich mit meinem Engagement und meinen Fähigkeiten einen positiven Beitrag zu Ihrem Team leisten kann. Dabei sollte gesondert erwähnt sein, dass das Praktikum ohne finanzielle Vergütung durchgeführt wird. Auf diese Weise können Sie von meinem Enthusiasmus und meiner Arbeitsmoral ohne finanzielle Aufwendungen profitieren. Darüber hinaus betrachte ich mein Praktikum als eine Möglichkeit, nicht nur wertvolle Erfahrungen zu sammeln, sondern mich als potenzieller zukünftiger Mitarbeiter mit den Abläufen und der Unternehmenskultur vertraut zu machen.",
    "internshipSection_3": "Während des Praktikums ist ein unternehmensbezogenes Projekt durchzuführen, das einen wesentlichen Teil der IHK-Abschlussprüfung ausmacht und mit 50% der Gesamtnote bewertet wird. Selbstverständlich werden unternehmensspezifische Inhalte und Interna gemäß Ihren Vorgaben vollständig gewahrt. Unabhängig der Gesamtdauer von neun Monaten beträgt die tatsächliche Präsenz in Ihrem Unternehmen sechs Monate. Dies ist auf Unterbrechungen durch die schulische Vorbereitung und Durchführung der schriftlichen Prüfungen zurückzuführen. Eine detaillierte Übersicht über den Zeitplan und dessen Inhalten finden Sie im nachfolgenden Link.",
    "schedule": "Zeitplan ansehen <small>(Excel, 34 KB)</small>",

    "advantages": "Vorzüge für Ihr Unternehmen",
    "companyBenefits": "Natürlich profitiere ich als Praktikant von Ihrem Wissen, Ihrer Zeit und kann meine Fähigkeiten verbessern. Aber welche Vorteile werde ich Ihrem Unternehmen als Praktikant bieten?",
    "benefitHeadline_1": "Keine Kosten",
    "benefitSubline_1": "Das Praktikum ist unbezahlt. Es entstehen keine finanziellen Aufwendungen",
    "benefitHeadline_2": "Neue Perspektiven",
    "benefitSubline_2": "Mit neuen Perspektiven entstehen neue Chancen und Kreativität",
    "benefitHeadline_3": "Routine bis Experte",
    "benefitSubline_3": "Anfangs werden Ihre Mitarbeiter bei Routineaufgaben entlastet und später professionell unterstützt",
    "benefitHeadline_4": "Perfekt geformt",
    "benefitSubline_4": "Formen Sie einen potenziellen zukünftigen Mitarbeiter gemäß Ihren Präferenzen",

    "certifiedKnowledge": "Zertifiziertes Wissen",
    "qualificationSection_1": "Während meiner selbstständigen Tätigkeit vor meiner aktuellen Ausbildung konzentrierte ich mich auf Technologien im Bereich Webentwicklung. Meine Expertise umfasst HTML, CSS und JavaScript, sowie grundlegendes Wissen über die jQuery-Bibliothek und das Bootstrap-Framework. Darüber hinaus habe ich durch Selbststudium grundlegende Fähigkeiten in der Java-Programmiersprache erworben.",
    "qualificationSection_2": "In meiner gegenwärtigen Ausbildung habe ich mein Verständnis für agiles Projektmanagement vertieft und die Zertifizierung in Scrum Foundations bestanden. Die Oracle Certified Associate-Prüfung ist für einen späteren Zeitpunkt im Verlauf meiner Ausbildung geplant. Um mein Wissen in meinem persönlichen Interessengebiet weiter zu vertiefen, habe ich relevante Zertifizierungen in der Programmiersprache JavaScript erworben.",
    "qualificationSubline_1": "Fortgeschrittenes Wissen in der JavaScript-Programmiersprache",
    "qualificationSubline_2": "Grundlegende Kenntnisse in der agilen Projektmethode Scrum",
    "qualificationSubline_3": "Grundlegendes Wissen in der JavaScript-Programmiersprache",
    "qualificationHeadline_4": "Ausbildung der Ausbilder (AdA)",
    "qualificationSubline_4": "Pädagogische Fähigkeiten und Techniken um Auszubildende auszubilden",
    "viewCertificate": "Zertifikat anschauen",

    "currentState": "Aktueller Stand",
    "trainingSection_1": "Bisher habe ich in meiner Ausbildung als Fachinformatiker ein breites Spektrum an Themen behandelt, die mein Verständnis und meine Fähigkeiten im IT-Bereich vertieft haben. Mit dem Schwerpunkt auf die Anwendungsentwicklung wurden Themen wie Kontrollstrukturen, objektorientierte Programmierung, Clean Code und Schnittstellen behandelt. Zusätzliche Bereiche wie Netzwerke, cyber-physische Systeme, IT-Sicherheit und Projektmanagement waren ebenfalls Teil des Lehrplans.",
    "trainingSection_2": "Neben den technischen Kenntnissen spielen auch wirtschaftliche Themen eine entscheidende Rolle in der Ausbildung. Die Integration von wirtschaftlichen Aspekten ermöglicht es mir nicht nur, technische Lösungen zu verstehen, sondern auch ihre wirtschaftliche Auswirkung zu bewerten und fundierte Entscheidungen zu treffen.",
    "trainingSection_3": "Mit einem aktuellen Notendurchschnitt von 1,2 kann ich auf einen positiven Verlauf meiner Ausbildung zurückblicken. Diese Bewertung soll mein Engagement im Rahmen dieser Bewerbung widerspiegeln und meine Fähigkeit betonen, komplexe Themen zu verstehen und erfolgreich umzusetzen. Ich beabsichtige, diese Entwicklung während des Praktikums in Ihrem Unternehmen fortzusetzen.",
    "viewTranscript": "Zwischenzeugnis <small>(PDF, 969KB)</small>",
    "averageGrade": "Notendurchschnitt",

    "resumeHeadline_1": "Ausbildung zum Fachinformatiker für Anwendungsentwicklung (IHK)",
    "resumeStation_1": "GfN, Mannheim",
    "resumeSubline_1": "Im Rahmen meiner Ausbildung zum Fach&shy;informatiker für Anwendungs&shy;entwicklung erwerbe ich umfassende Kenntnisse zu IT-bezogenen Themen wie Programmiersprachen, Projektmanagement, Administration, Netzwerken und wirtschaftlichen Themen.",
    "resumeHeadline_2": "Einzelunternehmer im E-Commerce",
    "resumeStation_2": "Sicktree Skateshop, Mannheim",
    "resumeSubline_2": "Selbstständige Tätigkeit als Einzelunternehmer im Online-Handel. Neben dem Versandhandel mit Produkten aus dem Sport- und Textilbereich umfasste mein Tätigkeitsfeld die Sortimentspflege und die digitale Produktpräsentation. Durch die kontinuierliche Optimierung der Unternehmenswebsite habe ich mich intensiv mit der Programmierung und Anpassung mithilfe von JavaScript, jQuery, HTML, CSS und Bootstrap beschäftigt.",
    "resumeHeadline_3": "Taxifahrer (Nebenberuflich)",
    "resumeStation_3": "Verschiedene, Ludwigshafen",
    "resumeSubline_3": "Personenbeförderung im Gelegenheitsverkehr. Die Tätigkeit umfasste die Bereitstellung von Fahrdienstleistungen für Passagiere des gesamten sozialen Spektrums sowie Unternehmenskunden.",
    "resumeHeadline_4": "Store Manager",
    "resumeStation_4": "Titus GmbH, Mannheim",
    "resumeSubline_4": "Leitung der Mannheimer Filiale des größten Handelsunternehmens in Europa, das auf Skateboarding spezialisiert ist. Zu den zahlreichen Aufgaben gehörten die Warenkontrolle, die Sortimentsplanung sowie die Personalentwicklung und Einsatzplanung. Neben administrativen Aufgaben war ich auch in Marketingaktivitäten involviert, einschließlich der Planung und Durchführung von Veranstaltungen. Die Vor-Ort-Leitung der Umsetzung einer neuen Filiale in Frankfurt (Main) gehörte zu meinen erweiterten Aufgaben.",
    "resumeHeadline_5": "Einzelhandelskaufmann",
    "resumeStation_5": "Titus Benztown GmbH, Mannheim",
    "resumeSubline_5": "Das Tätigkeitsfeld umfasste die kundenorientierte Beratung und den Verkauf vielfältiger Produkt- und Serviceangebote. Darüber hinaus gehörten zu meinen Verantwortlichkeiten die Präsentation der Ware, die Umsetzung verkaufsfördernder Maßnahmen sowie die Gestaltung von Auslagen, die Organisation von Verkaufsveranstaltungen und die Pflege des Produktbestands.",
    "educationHeadline_1": "Handelsassistent zBB",
    "educationStation_1": "Max-Hachenburg-Schule, Mannheim",
    "educationHeadline_2": "Einzelhandels&shy;kaufmann IHK",
    "educationStation_2": "Max-Hachenburg-Schule, Mannheim",

    "selfAssassement": "Selbsteinschätzung",
    "softskillsSection_1": "Als ehemals leitender Angestellter sowie durch meine selbstständige Tätigkeit sind mir viele der Erwartungen an einen Angestellten geläufig und in meinem Verständnis als Basis für eine produktive Arbeitsweise verankert. Selbstständiges, sorgfältiges und zügiges Arbeiten sowie eine gute Kommunikation fallen mir leicht und waren in meiner Tätigkeit als Store Manager eine Grundvoraussetzung.",
    "softskill_1": "Kommunikationsfähigkeit",
    "softskill_2": "Problemlösungskompetenz",
    "softskill_3": "Teamfähigkeit",
    "softskill_4": "Flexibilität und Anpassung",
    "softskill_5": "Selbstorganisation",
    "softskill_6": "Eigenmotivation",

    "contact": "Kontakt",
    "contactSection_1": "Bitte beachten Sie, dass aufgrund der Verfügbarkeit dieser Website keine Adress- oder Kontaktinformationen auf dieser Seite vorhanden sind. Alle notwendigen Informationen finden Sie in den eingereichten Bewerbungsunterlagen. Vielen Dank für Ihr Verständnis.",

    "viewCode": "Code anschauen",
    "viewCodeSection_1": "Diese Bewerbungswebsite dient auch als Projekt , das meine Fähigkeiten in HTML, CSS und JavaScript demonstriert. Klicken Sie auf das GitHub-Logo, um den Code anzuzeigen."
}