{
    "home": "Home",
    "about": "About",
    "internship": "Internship",
    "benefits": "Benefits",
    "qualifications": "Qualifications",
    "training": "Training",
    "resume": "Resume",
    "softskills": "Softskills",

    "headline": "A future professional for your company",
    "learnMore": "Learn more",

    "aboutSubline": "Application for an Internship",
    "aboutSection_1": "During my self-employment in E-commerce, I focused on various tasks, including the continuous optimization of the company's website. This involved adapting different templates, implementing new functionalities, and enhancing the user experience. While working on these programming tasks, I discovered that they were significantly more interesting and fulfilling than the implementation of business-related processes. With the opportunity for retraining and the associated entry into professional application development, I decided to cease my self-employment and dedicate all my energy to training.",
    "aboutSection_2": "This retraining corresponds to a state-supported education program for a Specialist in Application Development, with a shortened duration of two years. The academic content includes acquiring fundamental IT skills, IT professional qualifications, as well as certifications such as OCA (Oracle Certified Associate Java) and Agil Scrum Foundation. The retraining includes a mandatory  nine-month internship, taking place from May 6, 2024, to January 29, 2025. In addition to being eligible for the IHK examination, the internship aims to gain extended practical skills and insights into the real working life of an IT company. In this regard, I am applying for an internship position with your company and look forward to learning from you and contributing the newly acquired knowledge to your organization.",

    "internshipDate": "May 6th, 2024 - January 29th, 2025",
    "internshipSection_1": "With an internship in your company, I hope to expand my professional skills and look forward to applying this knowledge to the daily tasks of your business. Problem-solving in programming and adapting applications has fascinated me since my first encounter with the subject. It is mandatory to carry out a company-related project, which constitutes a significant part of the IHK final exam and is evaluated with 50% of the overall grade. Naturally, company-specific content will be preserved in accordance with your specifications.",
    "internshipSection_2": "I am confident that with my commitment and skills, I can make a positive contribution to your team. What makes this opportunity particularly appealing is that the internship will be undertaken without financial compensation. This allows you to benefit from my enthusiasm and work ethic without incurring additional costs. Furthermore, I see my internship as an opportunity not only to gain valuable experience but also to familiarize myself as a potential future employee with the processes and corporate culture. This perspective could create a long-term win-win situation for both parties.",
    "internshipSection_3": "During the internship, a company-related project is to be carried out, which constitutes a significant part of the IHK final exam and is graded with 50% of the overall grade. Of course, company-specific content and internal information will be fully respected according to your specifications. Regardless of the total duration of nine months, the actual presence in your company amounts to six months. This is due to interruptions caused by school exam preparation and the administration of written final exams. You can find a detailed overview of the timeline and its contents in the following link.",
    "schedule": "View Schedule <small>(Excel, 34 KB)</small>",

    "advantages": "Advantages for your company",
    "companyBenefits": "Sure, as an intern, I benefit from your knowledge, your time, and can enhance my skills. But what does your company gain from hiring me as an intern?",
    "benefitHeadline_1": "No Costs",
    "benefitSubline_1": "The internship position is unpaid. There are no financial expenses",
    "benefitHeadline_2": "New Perspectives",
    "benefitSubline_2": "With an unbiased perspective, new ideas and creativity emerge",
    "benefitHeadline_3": "Routine to Expert",
    "benefitSubline_3": "At the beginning, your employees will be relieved of routine tasks and professionally supported later",
    "benefitHeadline_4": "Perfectly shaped Employee",
    "benefitSubline_4": "Shape a potential future employee according to your preferences",

    "certifiedKnowledge": "Certified Knowledge",
    "qualificationSection_1": "During my professional experiences before my current training, I focused on technologies in the field of web development. My expertise included HTML, CSS, and JavaScript, along with basic knowledge of the jQuery library and the Bootstrap framework. Additionally, through self-study, I gained fundamental skills in the Java programming language.",
    "qualificationSection_2": "Throughout my training, I deepened my understanding of agile project management and obtained certification in Scrum Foundations. The Oracle Certified Associate exam is scheduled to take place later in the course of my training. To further enhance my knowledge in my personal area of interest, I obtained relevant certifications in the JavaScript programming language.",
    "qualificationSubline_1": "Advanced knowledge of the JavaScript programming language",
    "qualificationSubline_2": "Fundamental knowledge of Agile Project Management Scrum",
    "qualificationSubline_3": "Fundamental knowledge of the JavaScript programming language",
    "qualificationHeadline_4": "Training of <br>Trainers (AdA)",
    "qualificationSubline_4": "Pedagogical skills and knowledge for training trainees",
    "viewCertificate": "View Certificate",

    "currentState": "Current State",
    "trainingSection_1": "So far, during my training as an IT specialist, I have covered a wide range of topics that have deepened my understanding and skills in the IT field. With a focus on application development, subjects such as control structures, object-oriented programming, Clean Code, and interfaces were addressed. Additional areas such as networks, cyber-physical systems, IT security, and project management were also part of the curriculum.",
    "trainingSection_2": "In addition to the technical aspects, commercial topics played a crucial role. The integration of business knowledge allows me not only to comprehend technical solutions but also to assess their economic impacts and make informed decisions that consider both technical and economic requirements.",
    "trainingSection_3": "With an average grade of 1.2, I can look back on a positively progressing course of my education. This evaluation is intended to reflect my commitment in the context of this application and highlight my ability to comprehend and successfully implement complex subjects. I aim to continue this development during the internship at your company.",
    "viewTranscript": "Transcript <small>(PDF, 969KB)</small>",
    "averageGrade": "Average Grade",

    "resumeHeadline_1": "Trainee IT-Specialist Application Development (IHK)",
    "resumeStation_1": "GfN, Mannheim",
    "resumeSubline_1": "As part of my training as an IT specialist for application development, I am acquiring comprehensive knowledge in IT-related subjects such as programming languages, project management, administration, networks, and business-related topics.",
    "resumeHeadline_2": "Sole Proprietor in E-Commerce",
    "resumeStation_2": "Sicktree Skateshop, Mannheim",
    "resumeSubline_2": "Self-employed activity as a sole proprietor in online commerce. In addition to mail-order business in the sports and textile sector, tasks such as assortment maintenance and digital product presentation were within my scope of work. Through the continuous optimization of the company website, I engaged extensively in programming and adjustments using JavaScript, jQuery, HTML, CSS, and Bootstrap.",
    "resumeHeadline_3": "Taxi Driver (Part-Time)",
    "resumeStation_3": "Various, Ludwigshafen",
    "resumeSubline_3": "Activity in occasional passenger transport. This involved providing services for passengers from the entire social spectrum as well as for corporate clients.",
    "resumeHeadline_4": "Store Manager",
    "resumeStation_4": "Titus GmbH, Mannheim",
    "resumeSubline_4": "Management of the Mannheim branch of the largest trading company in Europe specializing in skateboarding. Among the numerous responsibilities were merchandise control, assortment planning, as well as personnel development and deployment planning. In addition to administrative tasks, I was involved in marketing activities, including the planning and execution of events. Managing the on-site establishment of new stores was also part of my extended duties.",
    "resumeHeadline_5": "Retail Merchant",
    "resumeStation_5": "Titus Benztown GmbH, Mannheim",
    "resumeSubline_5": "As retail merchant, customer-oriented consultation and the sale of various service offerings were part of my daily tasks. Furthermore, responsibilities included presenting merchandise in the storefront, implementing sales-promoting measures such as decorating display windows, organizing sales events, and maintaining product inventory.",
    "educationHeadline_1": "Trading Assistent zBB",
    "educationStation_1": "Max-Hachenburg-Business-School, Mannheim",
    "educationHeadline_2": "Retail Merchant IHK",
    "educationStation_2": "Max-Hachenburg-Business-School, Mannheim",

    "selfAssassement": "Self-Assassement",
    "softskillsSection_1": "As a former senior employee and through my experience as a self-employed professional, I am familiar with many of your expectations for an employee, and I consider them the foundation for a productive work approach. Independent, meticulous, and efficient work, as well as effective communication with fellow employees, come naturally to me and have been fundamental requirements in my previous roles.",
    "softskill_1": "Communication",
    "softskill_2": "Problem-Solving",
    "softskill_3": "Teamwork",
    "softskill_4": "Flexibility & Adaptablility",
    "softskill_5": "Self-Management",
    "softskill_6": "Self-Motivation",

    "contact": "Contact",
    "contactSection_1": "Please note that due to the availablity of this website there are no address or contact details on this page. All necessary information can be found in the submitted application documents. Thank you for your understanding.",

    "viewCode": "View Code",
    "viewCodeSection_1": "This application website is intended to showcase a project that demonstrates my skills in HTML, CSS, and JavaScript. Click on the GitHub logo to view the code."
}